The  BuiltInFailures PathFailures  type exposes the following members.
 Properties
Name  |   Description
Path3dRegenError
 Picked Path could not be regenerated.
 See Also
  BuiltInFailures PathFailures Class
  Autodesk.Revit.DB Namespace